#### FabricationPartBrowserChangedEventArgs Members

---

|  |
| --- |
| FabricationPartBrowserChangedEventArgs Class   Methods   Properties   See Also |

The  FabricationPartBrowserChangedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RevitAPIEventArgs  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAllSolutionsPartsTypeCounts | Returns the total fabrication part type usage count in all routing solutions. |
| Public method | GetCurrentSolutionPartTypeIds | Returns set of fabrication part types that are used in the currently selected solution. |
| Public method | GetFabricationPartTypeIds | Returns set of fabrication part types in use in the routing solution mode. |
| Public method | GetFilteredSolutionsPartsTypeCounts | Returns the active fabrication part type usage count in fitlered routing solutions. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRequiredFabricationPartTypeIds | Returns set of required fabrication part types in use in routing solution mode. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCancelled | Indicates whether the event is being cancelled. (Inherited from  RevitAPIEventArgs  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitAPIEventArgs  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RevitAPIEventArgs  .) |
| Public property | NumberOfSolutions | The number of active solutions in routing solution mode. |
| Public property | Operation | The operation associated with this event |
| Public property | ServiceId | The identifier for the fabrication service. |

# See Also

FabricationPartBrowserChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace